In [1]:
## import stuff
import pandas as pd
import numpy as np
import os

 # This is ass. 2
 ## Hausarbeit im Modul Data Analytics mit Python SS23
 ## focus is on data wrangling and manipulation
 ### There are 10 queries to write

In [2]:
## get data
##path = "https://raw.githubusercontent.com/VAWi-DataScience/Data-Analytics-with-Python/main/Lecture/03_Data_Wrangling/data/"
path = "https://raw.githubusercontent.com/Ph1lippK/DAPy/master/02_Assignment%20Data-20230529/"
##https://github.com/Ph1lippK/DAPy/tree/7804e0b4a8a4cb6df65774e5795007149effa935/02_Assignment%20Data-20230529
customers = pd.read_csv(path + "/customers.csv")
products = pd.read_csv(path + "/products.csv")
orders = pd.read_csv(path + "/orders.csv")
sales = pd.read_csv(path + "/sales.csv")

# Query 01
1. Decrease the price of all trousers by 30 percent and 
1. increase the price of all shirts by 10 percent. 
1. Print out the first five shirts and the last five pairs of trousers.

In [3]:
#products.head()
## checking where I can find my trousers and shirts
# Get the unique values of the "product_id" column
unique_product_types = products["product_type"].unique()
# Print the unique product types
print(unique_product_types)

['Shirt' 'Jacket' 'Trousers']

In [4]:
## checking unique entries in my price column
# Get the unique values of the "price" column
unique_product_prices = products["price"].unique()
# Print the unique product types
##print(unique_product_prices)
## check for datatypes, since I want to multiple prices later
##products.dtypes

In [5]:
## in- and decreasing prices in a new column using .apply along with lambda
products['adjusted_price'] = products.apply(lambda row: row['price']*1.1 if row['product_type'] == 'Shirt' else (row['price']*0.7 if row['product_type'] == 'Trousers' else row['price']), axis=1)

In [6]:
##Print out the first five shirts and the last five pairs of trousers.
products[products['product_type'] == 'Shirt'].head()

,product_id,product_type,product_name,size,colour,price,p_quantity,description,adjusted_price
0,0,Shirt,Oxford Cloth,XS,red,114,66,"A red coloured, XS sized, Oxford Cloth Shirt",125.4
1,1,Shirt,Oxford Cloth,S,red,114,53,"A red coloured, S sized, Oxford Cloth Shirt",125.4
2,2,Shirt,Oxford Cloth,M,red,114,54,"A red coloured, M sized, Oxford Cloth Shirt",125.4
3,3,Shirt,Oxford Cloth,L,red,114,69,"A red coloured, L sized, Oxford Cloth Shirt",125.4
4,4,Shirt,Oxford Cloth,XL,red,114,47,"A red coloured, XL sized, Oxford Cloth Shirt",125.4

In [7]:
## and the last five pairs of trousers.
products[products['product_type'] == 'Trousers'].tail()

,product_id,product_type,product_name,size,colour,price,p_quantity,description,adjusted_price
1255,1255,Trousers,Tracksuit Bottoms,XS,violet,91,67,"A violet coloured, XS sized, Tracksuit Bottoms...",63.7
1256,1256,Trousers,Tracksuit Bottoms,S,violet,91,48,"A violet coloured, S sized, Tracksuit Bottoms ...",63.7
1257,1257,Trousers,Tracksuit Bottoms,M,violet,91,73,"A violet coloured, M sized, Tracksuit Bottoms ...",63.7
1258,1258,Trousers,Tracksuit Bottoms,L,violet,91,45,"A violet coloured, L sized, Tracksuit Bottoms ...",63.7
1259,1259,Trousers,Tracksuit Bottoms,XL,violet,91,60,"A violet coloured, XL sized, Tracksuit Bottoms...",63.7

# Query 02
Display the information of all customers younger than 40, who live in cities, that end with "land"

In [8]:
#customers.head()

In [9]:
# customers younger than 40
young_customers = customers[customers['age'] < 40]  
# cities that end with 'land'
result = young_customers[young_customers['city'].str.endswith('land')]  
result

,customer_id,customer_name,gender,age,home_address,zip_code,city,state,country
10,11,Michaeline McIndrew,Agender,39,96 Daniel PlaceSuite 898,7400,Georgeland,Northern Territory,Australia
148,149,Marven Argontt,Non-binary,25,5831 Lilly AvenueSuite 322,4101,Port Christopherland,New South Wales,Australia
228,229,Codie Escalero,Female,20,434 Gibson MewsSuite 619,1344,West Abbeyland,Australian Capital Territory,Australia
254,255,Justis Butter,Polygender,29,4958 Harry TrackApt. 721,4733,Port Johnland,Western Australia,Australia
261,262,Dasi Kovelmann,Genderfluid,34,8303 Imogen SquareApt. 902,1633,Jakeland,Northern Territory,Australia
470,471,Hayyim Trewhella,Non-binary,31,8662 Maya PlaceApt. 834,8731,Boyerland,New South Wales,Australia
563,564,Shoshana Redsell,Bigender,34,65 Schroeder WayApt. 552,4054,North Marcusland,Northern Territory,Australia
589,590,Prentiss Stroder,Polygender,31,7131 Walter GroveSuite 897,9414,Jaydenland,Northern Territory,Australia
590,591,Danny Brabham,Agender,30,2181 Maddison RidgeApt. 277,7591,Isabelland,Western Australia,Australia
607,608,Lotte Jaouen,Genderfluid,32,622 Cox WaySuite 694,6235,West Isabellaland,South Australia,Australia
620,621,Krysta Chaster,Genderqueer,32,3423 Jenkins PlaceApt. 152,3128,Lake Michaelland,Western Australia,Australia
656,657,Orran Skip,Male,25,95 Skye PassApt. 600,7643,Port Eveland,South Australia,Australia
745,746,Dennie Lawson,Female,32,75 Ali IslandSuite 270,2913,Sarahland,Victoria,Australia
780,781,Denny Parlour,Genderfluid,36,2785 Morgan BoulevardApt. 849,6220,Madisonland,Victoria,Australia
788,789,Bone Perche,Genderqueer,36,638 Thomas ManorApt. 038,1438,Aliceland,Western Australia,Australia
809,810,Charles Duffitt,Non-binary,21,93 Anna TerraceSuite 700,2355,South Maxland,Australian Capital Territory,Australia
819,820,Normy Anlay,Male,26,10 Imogen PassSuite 135,8014,Alexanderland,Queensland,Australia
842,843,Sheela Dovey,Genderqueer,23,201 Anthony TerraceSuite 543,6272,Lake Addisonland,South Australia,Australia
887,888,Teresita Ayling,Genderqueer,22,184 Joshua CrestApt. 140,968,Ellieland,Northern Territory,Australia
916,917,Hadleigh Berzons,Genderqueer,36,2475 Cox CrestSuite 319,3806,North Charlesland,Western Australia,Australia
943,944,Peri Pilsworth,Genderfluid,36,409 Alyssa CourtApt. 204,8196,Walterland,Victoria,Australia

# Query 03
Add the following new product:

- product_type: Trousers
- product_name: Jeans
- size: M
- colour: black
- price: 120
- p_quantity: 10
- description: "A black coloured, M sized, Jeans Trousers"

In [10]:
products.tail()

,product_id,product_type,product_name,size,colour,price,p_quantity,description,adjusted_price
1255,1255,Trousers,Tracksuit Bottoms,XS,violet,91,67,"A violet coloured, XS sized, Tracksuit Bottoms...",63.7
1256,1256,Trousers,Tracksuit Bottoms,S,violet,91,48,"A violet coloured, S sized, Tracksuit Bottoms ...",63.7
1257,1257,Trousers,Tracksuit Bottoms,M,violet,91,73,"A violet coloured, M sized, Tracksuit Bottoms ...",63.7
1258,1258,Trousers,Tracksuit Bottoms,L,violet,91,45,"A violet coloured, L sized, Tracksuit Bottoms ...",63.7
1259,1259,Trousers,Tracksuit Bottoms,XL,violet,91,60,"A violet coloured, XL sized, Tracksuit Bottoms...",63.7

In [11]:
# New product details
new_product = {
    'product_id': 1260,
    'product_type': 'Trousers',
    'product_name': 'Jeans',
    'size': 'M',
    'colour': 'black',
    'price': 120,
    'p_quantity': 10,
    'description': 'A black coloured, M sized, Jeans Trousers',
    'adjusted_price': 84
}

# Add new product to the dataframe
products = products.append(new_product, ignore_index=True)
# Display the updated dataframe
products.tail()

C:\Users\pknuhman\AppData\Local\Temp\ipykernel_23416\1813958378.py:15: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  products = products.append(new_product, ignore_index=True)

,product_id,product_type,product_name,size,colour,price,p_quantity,description,adjusted_price
1256,1256,Trousers,Tracksuit Bottoms,S,violet,91,48,"A violet coloured, S sized, Tracksuit Bottoms ...",63.7
1257,1257,Trousers,Tracksuit Bottoms,M,violet,91,73,"A violet coloured, M sized, Tracksuit Bottoms ...",63.7
1258,1258,Trousers,Tracksuit Bottoms,L,violet,91,45,"A violet coloured, L sized, Tracksuit Bottoms ...",63.7
1259,1259,Trousers,Tracksuit Bottoms,XL,violet,91,60,"A violet coloured, XL sized, Tracksuit Bottoms...",63.7
1260,1260,Trousers,Jeans,M,black,120,10,"A black coloured, M sized, Jeans Trousers",84.0

# Query 04
Display how many orders were made by the customer Ellynn Korba.

In [51]:
## merge orders and customers
query4 = pd.merge(orders,customers,how='left',on='customer_id')[['order_id','customer_id', 'customer_name']]
query4.head()

   order_id  customer_id        customer_name
0         1           64     Annabella Devote
1         2          473          Lori Briars
2         3          774         Ellynn Korba
3         4          433      Candis Roswarne
4         5          441  Artemas Vasilischev

In [45]:
## there is 2 approaches, first one: 
# Filter the dataframe based on the customer name
ellynn_orders = query4[query4['customer_name'] == 'Ellynn Korba']
# Get the count of orders made by Ellynn Korba
order_count = len(ellynn_orders)
# Display the result
print(f"The number of orders made by Ellynn Korba: {order_count}")

The number of orders made by Ellynn Korba: 3

In [60]:
## second one:
# Filter values of 'name' column when name is equal to "Peter"
filtered_values = query4[query4['customer_name'] == 'Ellynn Korba']
# Display the filtered values
filtered_values.head()

     order_id  customer_id customer_name
2           3          774  Ellynn Korba
352       353          774  Ellynn Korba
943       944          774  Ellynn Korba

# Query 05
Display the order_id, order_date, and delivery_date of all orders made by the customer Candis Roswarne.

- customer_name is in df customers
- order_id is in df df orders
- order_date is in df orders
- delivery_date is in df orders

In [57]:
## merge orders with customers
query5 = pd.merge(orders,customers,how='left',on='customer_id')[['customer_name','order_id','order_date','delivery_date',]]
query5.head()

         customer_name  order_id order_date delivery_date
0     Annabella Devote         1  2021-8-30    2021-09-24
1          Lori Briars         2   2021-2-3    2021-02-13
2         Ellynn Korba         3  2021-10-8    2021-11-03
3      Candis Roswarne         4   2021-5-6    2021-05-19
4  Artemas Vasilischev         5  2021-3-23    2021-03-24

In [59]:
filtered_values5 = query5[query5['customer_name'] == 'Candis Roswarne']
# Display the filtered values
filtered_values5.head()

       customer_name  order_id order_date delivery_date
3    Candis Roswarne         4   2021-5-6    2021-05-19
250  Candis Roswarne       251  2021-7-31    2021-08-27
317  Candis Roswarne       318  2021-1-31    2021-02-17

# Query 06
Show the details (all are in df customers)
- name
- gender
- age
of the customers, who ordered a product with the description "A red coloured, S sized, Oxford Cloth Shirt".
That information is in df products, thus I have to merge customers w/ orders w / sales w/ products

In [ ]:
## [['customer_name','order_id','order_date','delivery_date',]]

In [72]:
## merge customers w/ orders w / sales w/ products
## now using how=inner to only get matching records
query6 = pd.merge(customers,orders,how='inner',on='customer_id')[['customer_id','customer_name','gender','age','order_id']]
##merging sales
query6 = pd.merge(query6,sales,how='inner',on='order_id')[['customer_id','customer_name','gender','age','order_id','product_id']]
##merging products
query6 = pd.merge(query6,products,how='inner',on='product_id')[['customer_id','customer_name','gender','age','order_id','product_id','description']]
query6.head()

,customer_id,customer_name,gender,age,order_id,product_id,description
0,1,Leanna Busson,Female,30,455,211,"A red coloured, S sized, Chambray Shirt"
1,1,Leanna Busson,Female,30,455,783,"A yellow coloured, L sized, Pullover Jacket"
2,81,Lanny Wardale,Female,30,863,783,"A yellow coloured, L sized, Pullover Jacket"
3,258,Mira Heinonen,Female,62,793,783,"A yellow coloured, L sized, Pullover Jacket"
4,432,Ettie Gonnely,Bigender,34,939,783,"A yellow coloured, L sized, Pullover Jacket"

In [79]:
filtered_values6 = query6[query6['description'] == 'A red coloured, S sized, Oxford Cloth Shirt']
# Display the filtered values
filtered_values6[['customer_name','gender','age','description']]

,customer_name,gender,age,description
3011,Brade Caught,Genderqueer,56,"A red coloured, S sized, Oxford Cloth Shirt"
3012,Artemas Vasilischev,Bigender,53,"A red coloured, S sized, Oxford Cloth Shirt"
3013,Olimpia Tankus,Genderfluid,39,"A red coloured, S sized, Oxford Cloth Shirt"
3014,Thorsten Sowrey,Polygender,50,"A red coloured, S sized, Oxford Cloth Shirt"
3015,Ellynn Korba,Genderqueer,34,"A red coloured, S sized, Oxford Cloth Shirt"

# Query 07
Display the name of the customer who made the most orders.

In [96]:
## merge orders with customers
query7 = pd.merge(orders,customers,how='inner',on='customer_id')[['customer_name','order_id']]
## count orders and show dataframe
query7.groupby('customer_name').count().sort_values(by='order_id', ascending=False)

                  order_id
customer_name
Kristofor Roos           6
Melissa Partkya          5
Dannie Fidler            5
Thorny Nornable          5
Wren Helgass             5
...                    ...
Gunner Murdie            1
Grissel Harteley         1
Griffy Wenger            1
Glynda Dodshon           1
Zorina Rabl              1

[617 rows x 1 columns]

In [94]:
# Group the dataframe by customer_name and count the number of orders for each customer
order_counts = query7.groupby('customer_name')['order_id'].count()
# Find the customer with the maximum order count
customer_with_most_orders = order_counts.idxmax()
# Display the name of the customer with the most orders
print(f"The customer who made the most orders: {customer_with_most_orders}")

The customer who made the most orders: Kristofor Roos

# Query 08
1. Find all sales transactions of orange shirts and display the result 
- sales_id (df sales)
- name (assuming product name, thus df products)
- type (assuming product type, thus df products) 
- description of the product (df products)
2. Rename the columns as follows:
- "product_type" --> "Type"
- "product_name" --> "Name"

In [115]:
## merge sales w/ products
## now using how=inner to only get matching records
query8 = pd.merge(sales,products,how='inner',on='product_id')[['sales_id','product_name','product_type','colour','description']]
query8.head()

,sales_id,product_name,product_type,colour,description
0,0,Chambray,Shirt,orange,"A orange coloured, L sized, Chambray Shirt"
1,1129,Chambray,Shirt,orange,"A orange coloured, L sized, Chambray Shirt"
2,4616,Chambray,Shirt,orange,"A orange coloured, L sized, Chambray Shirt"
3,1,Puffer,Jacket,indigo,"A indigo coloured, S sized, Puffer Jacket"
4,349,Puffer,Jacket,indigo,"A indigo coloured, S sized, Puffer Jacket"

In [117]:
filtered_values8 = query8[(query8['product_type'] == 'Shirt') & (query8['colour'] == 'orange')]                                               
# Display the filtered values
filtered_values8[['sales_id','product_name','product_type','description']]

,sales_id,product_name,product_type,description
0,0,Chambray,Shirt,"A orange coloured, L sized, Chambray Shirt"
1,1129,Chambray,Shirt,"A orange coloured, L sized, Chambray Shirt"
2,4616,Chambray,Shirt,"A orange coloured, L sized, Chambray Shirt"
53,13,Oxford Cloth,Shirt,"A orange coloured, S sized, Oxford Cloth Shirt"
54,1640,Oxford Cloth,Shirt,"A orange coloured, S sized, Oxford Cloth Shirt"
...,...,...,...,...
4707,4708,Polo,Shirt,"A orange coloured, S sized, Polo Shirt"
4708,4996,Polo,Shirt,"A orange coloured, S sized, Polo Shirt"
4757,2825,Dress,Shirt,"A orange coloured, XL sized, Dress Shirt"
4758,3495,Dress,Shirt,"A orange coloured, XL sized, Dress Shirt"
4879,3197,Mandarin Collar,Shirt,"A orange coloured, XS sized, Mandarin Collar S..."

In [121]:
## Rename the columns as follows: "product_type" --> "Type" "product_name" --> "Name"
filtered_values8.rename(columns={"product_name": "Name", "product_type": "Type"})

,sales_id,Name,Type,colour,description
0,0,Chambray,Shirt,orange,"A orange coloured, L sized, Chambray Shirt"
1,1129,Chambray,Shirt,orange,"A orange coloured, L sized, Chambray Shirt"
2,4616,Chambray,Shirt,orange,"A orange coloured, L sized, Chambray Shirt"
53,13,Oxford Cloth,Shirt,orange,"A orange coloured, S sized, Oxford Cloth Shirt"
54,1640,Oxford Cloth,Shirt,orange,"A orange coloured, S sized, Oxford Cloth Shirt"
...,...,...,...,...,...
4707,4708,Polo,Shirt,orange,"A orange coloured, S sized, Polo Shirt"
4708,4996,Polo,Shirt,orange,"A orange coloured, S sized, Polo Shirt"
4757,2825,Dress,Shirt,orange,"A orange coloured, XL sized, Dress Shirt"
4758,3495,Dress,Shirt,orange,"A orange coloured, XL sized, Dress Shirt"
4879,3197,Mandarin Collar,Shirt,orange,"A orange coloured, XS sized, Mandarin Collar S..."

# Query 09
Display the 
- product id (df products)
- the product name (df products)
- the description (df products)

of the product that has been sold most often.

In [124]:
## merge sales w/ products
## now using how=inner to only get matching records
query9 = pd.merge(sales,products,how='inner',on='product_id')[['sales_id','product_id','product_name','description']]
query9

,sales_id,product_id,product_name,description
0,0,218,Chambray,"A orange coloured, L sized, Chambray Shirt"
1,1129,218,Chambray,"A orange coloured, L sized, Chambray Shirt"
2,4616,218,Chambray,"A orange coloured, L sized, Chambray Shirt"
3,1,481,Puffer,"A indigo coloured, S sized, Puffer Jacket"
4,349,481,Puffer,"A indigo coloured, S sized, Puffer Jacket"
...,...,...,...,...
4995,4848,510,Windbreaker,"A blue coloured, XS sized, Windbreaker Jacket"
4996,4864,255,Polo,"A yellow coloured, XS sized, Polo Shirt"
4997,4883,735,Peacoat,"A red coloured, XS sized, Peacoat Jacket"
4998,4912,659,Coach,"A indigo coloured, XL sized, Coach Jacket"
4999,4998,998,Wool,"A green coloured, L sized, Wool Trousers"

In [129]:
group9  = query9.groupby('product_id').count()
group9.sort_values(by='sales_id', ascending=False)

            sales_id  product_name  description
product_id
78                13            13           13
740               12            12           12
843               11            11           11
579               11            11           11
1038              10            10           10
...              ...           ...          ...
461                1             1            1
188                1             1            1
763                1             1            1
438                1             1            1
602                1             1            1

[1233 rows x 3 columns]

In [142]:
filtered_values9 = query9[(query9['product_id'] == 78)]                                               
# Display the filtered values
#filtered_values9
one_entry = filtered_values9.head(1)
one_entry[['product_id','product_name','description']]

     product_id product_name                                description
980          78      Flannel  A orange coloured, L sized, Flannel Shirt

# Query 10
Display the 
- name and
- description 

of the products, 
that have been sold with a total price of more than 250. 
Sort them descending according to the total price.

In [149]:
## merge sales w/ products
## now using how=inner to only get matching records
query10 = pd.merge(sales,products,how='inner',on='product_id')[['sales_id','product_id','product_name','description','price','total_price']]
query10.sort_values(by='total_price', ascending=False)

,sales_id,product_id,product_name,description,price,total_price
1096,672,717,Trench Coat,"A green coloured, M sized, Trench Coat Jacket",112,357
4850,4780,732,Trench Coat,"A violet coloured, M sized, Trench Coat Jacket",112,357
647,4445,407,Casual Slim Fit,"A blue coloured, M sized, Casual Slim Fit Shirt",113,357
2929,3078,413,Casual Slim Fit,"A indigo coloured, L sized, Casual Slim Fit Shirt",113,357
2567,4798,387,Casual Slim Fit,"A red coloured, M sized, Casual Slim Fit Shirt",113,357
...,...,...,...,...,...,...
61,15,1033,Relaxed Leg,"A green coloured, L sized, Relaxed Leg Trousers",95,90
3656,3583,1018,Relaxed Leg,"A red coloured, L sized, Relaxed Leg Trousers",95,90
3655,1239,1018,Relaxed Leg,"A red coloured, L sized, Relaxed Leg Trousers",95,90
1767,1908,1022,Relaxed Leg,"A orange coloured, M sized, Relaxed Leg Trousers",95,90
743,726,1043,Relaxed Leg,"A indigo coloured, L sized, Relaxed Leg Trousers",95,90

In [150]:
filtered_values10 = query10[(query10['total_price'] > 250)]                                               
# Display the filtered values
filtered_values10

,sales_id,product_id,product_name,description,price,total_price
1,1129,218,Chambray,"A orange coloured, L sized, Chambray Shirt",105,318
8,3669,481,Puffer,"A indigo coloured, S sized, Puffer Jacket",110,354
9,2,2,Oxford Cloth,"A red coloured, M sized, Oxford Cloth Shirt",114,288
17,1170,1002,Wool,"A blue coloured, M sized, Wool Trousers",111,318
18,3347,1002,Wool,"A blue coloured, M sized, Wool Trousers",111,318
...,...,...,...,...,...,...
4978,4915,1088,Cropped,"A red coloured, L sized, Cropped Trousers",99,345
4981,4342,763,Peacoat,"A indigo coloured, L sized, Peacoat Jacket",102,327
4983,4679,418,Casual Slim Fit,"A violet coloured, L sized, Casual Slim Fit Shirt",113,357
4988,4599,609,Cardigan,"A yellow coloured, XL sized, Cardigan Jacket",118,336
4996,4864,255,Polo,"A yellow coloured, XS sized, Polo Shirt",117,285

In [153]:
filtered_values10[['product_name','description','total_price']].sort_values(by='total_price', ascending=False)

,product_name,description,total_price
1984,Casual Slim Fit,"A orange coloured, XL sized, Casual Slim Fit S...",357
4027,Trench Coat,"A yellow coloured, L sized, Trench Coat Jacket",357
3990,Casual Slim Fit,"A yellow coloured, XL sized, Casual Slim Fit S...",357
3996,Casual Slim Fit,"A yellow coloured, XL sized, Casual Slim Fit S...",357
3174,Trench Coat,"A indigo coloured, M sized, Trench Coat Jacket",357
...,...,...,...
2378,Relaxed Leg,"A yellow coloured, S sized, Relaxed Leg Trousers",270
1727,Relaxed Leg,"A yellow coloured, XS sized, Relaxed Leg Trousers",270
1728,Relaxed Leg,"A yellow coloured, XS sized, Relaxed Leg Trousers",270
3512,Relaxed Leg,"A orange coloured, XL sized, Relaxed Leg Trousers",270
1289,Relaxed Leg,"A blue coloured, L sized, Relaxed Leg Trousers",270